{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": "uid",
                "title": "Ідентифікатор зарядної станції",
                "description": "Вказується ідентифікатор зарядної станції, за відсутності вказати: null. Наприклад: abcd1234",
                "datatype": "string",
                "required": false
            },
            {
                "name": "ownerName",
                "title": "Назва власника (балансоутримувача) зарядної станції",
                "description": "Повна назва юридичної особи або ім'я, прізвище, по батькові фізичної особи-підприємця власника (балансоутримувача) зарядної станції. Наприклад: КП «Тесла»",
                "datatype": "string",
                "required": true
            },
            {
                "name": "ownerId",
                "title": "Код ЄДРПОУ власника (балансоутримувача) зарядної станції",
                "description": "Код ЄДРПОУ власника (балансоутримувача) зарядної станції. Наприклад: 01411082. Дані реєстраційного номера облікової картки платника податків фізичної особи-підприємця знеособлюються",
                "datatype": "string",
                "required": true
            },
            {
                "name": "ownerTelephone",
                "title": "Контактний номер телефону власника (балансоутримувача) зарядної станції",
                "description": "Номер телефону має починатися з +380, включати код населеного пункту або оператора та телефонний номер (12 цифр, без пробілів і дужок). Наприклад: +380123456789. У електронних таблицях допускається написання коду країни 380 або використання комбінації ‘+ (апостроф та плюс). У випадку вказання кількох номерів телефону розділити значення комою",
                "datatype": "string",
                "required": true
            },
            {
                "name": "ownerEmail",
                "title": "Контактна адреса електронної пошти власника (балансоутримувача) зарядної станції",
                "description": "Адреса електронної пошти. Наприклад: contact@example.gov.ua. У випадку вказання кількох адрес розділити значення комами",
                "datatype": "string",
                "required": true
            },
            {
                "name": "workingHours",
                "title": "Графік роботи зарядної станції",
                "description": "Дні тижня позначаються комбінаціями літер (Пн, Вт, Ср, Чт, Пт, Сб, Нд), години — цифрами у 24-годинному форматі (ГГ:ХХ). Для графіка з понеділка до п’ятниці, з 9:00 до 17:00 запис в таблиці матиме вигляд — Пн-Пт 09:00-17:00. Коли потрібно позначити інтервал днів (з понеділка до п’ятниці), використовується дефіс, коли окремі дні (понеділок та п’ятниця) — кома. Наприклад: графік роботи в понеділок і п’ятницю з 09:00-17:00 матиме такий вигляд: Пн,Пт 09:00-17:00. Якщо графік змінюється протягом тижня, різні режими роботи необхідно записати через кому. Наприклад: Пн-Чт 08:00-17:20, Пт 08:00-16:00",
                "datatype": "string",
                "required": true
            },
            {
                "name": "stationAccess",
                "title": "Доступ до зарядної станції",
                "description": "Вказується вільний або обмежений доступ до зарядної станції. Якщо станція знаходиться на приватній території, до якої доступ лише певний час доби, або за перепустками, - вказується обмежений.",
                "datatype": "string",
                "required": true
            },
            {
                "name": "connectorsType",
                "title": "Типи роз’ємів які є у зарядної станції, напруга, сила струму та їхня потужність",
                "description": "Вказуються роз’єми зарядних станцій, відповідно до їхньої технічної специфікації, в дужках вказується сила струму та потужність. Якщо роз'єми різнотипні, значення розділяються комами. Наприклад: Type 2(380-400В, 63А, 44 кВт), Type Tesla (220-240В, 80A, 17 кВт)",
                "datatype": "string",
                "required": true
            },
            {
                "name": "CATUTTC",
                "title": "Код КАТОТГ",
                "description": "Код КАТОТТГ адміністративної одиниці. Наприклад: UA32140050010021659",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressPostCode",
                "title": "Поштовий індекс",
                "description": "Поштовий індекс адреси, до якої прив’язана зарядна станція, за відсутності вказати: null. Наприклад: 01234",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressAdminUnitL1",
                "title": "Країна",
                "description": "Назва країни. У колонці має бути зазначено: Україна",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL2",
                "title": "Область",
                "description": "Назва області, де розміщена зарядна станція. Наприклад: Полтавська область",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL3",
                "title": "Район",
                "description": "Назва району, де розміщена зарядна станція. Наприклад: Броварський район. У разі відсутності вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressPostName",
                "title": "Населений пункт",
                "description": "Назва населеного пункту або назва селищної чи сільської ради, де розміщене насадження. У колонці потрібно зазначати лише назву (без слова «місто», «селищна рада» та їх скорочень «м.» та «с. р.»). Наприклад: Балта",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressThoroughfare",
                "title": "Вулиця або аналог",
                "description": "Тип та назва площі, майдану, шосе, проспекту, бульвару, алеї, провулку, узвозу тощо, де розміщена зарядна станція. Наприклад: вул. Харківська",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressLocatorDesignator",
                "title": "Номер будівлі",
                "description": "Номер будівлі (об’єкта), де розміщена зарядна станція, може включати числа та букви. Наприклад: 15-А",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressLocatorBuilding",
                "title": "Номер корпусу",
                "description": "Номер корпусу, де розміщена зарядна станція, зазнається числом для об’єктів, які складаються з декількох корпусів. Наприклад: 3. У разі відсутності, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressDescription",
                "title": "Опис розміщення",
                "description": "Опис вказується за потреби, щоб чіткіше визначити розміщення. Наприклад: Центральна алея",
                "datatype": "string",
                "required": false
            },
            {
                "name": "lat",
                "title": "Географічна широта",
                "description": "Географічна широта розташування зарядної станції. Розділювач десяткових значень — крапка. Наприклад: 50.457718. У разі відсутності вказати: null",
                "datatype": "decimal",
                "required": false
            },
            {
                "name": "lon",
                "title": "Географічна довгота",
                "description": "Географічна довгота зарядної станції. Розділювач десяткових значень — крапка. Наприклад: 30.487021. У разі відсутності вказати: null",
                "datatype": "decimal",
                "required": false
            }
        ]
    },
    "primaryKey": "uid"
}