{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": "uid",
                "title": "Унікальний ідентифікатор полігону",
                "description": "Вказується унікальний довільний ідентифікатор полігону. Наприклад: 123-п",
                "datatype": "string",
                "required": true
            },
            {
                "name": "name",
                "title": "Назва полігону",
                "description": "Вказується назва полігону. Наприклад: Полігон твердих побутових відходів (ТПВ) № 5 в селі Підгірці",
                "datatype": "string",
                "required": true
            },
            {
                "name": "startYear",
                "title": "Рік введення полігону в експлуатацію",
                "description": "Вказується рік введення полігону в експлуатацію. Наприклад: 1985",
                "datatype": "date",
                "required": true
            },
            {
                "name": "balanceHolderName",
                "title": "Найменування балансоутримувача",
                "description": "Повна назва юридичної особи балансоутримувача полігону Наприклад: КП «Полігон»",
                "datatype": "string",
                "required": true
            },
            {
                "name": "balanceHolderId",
                "title": "Код ЄДРПОУ балансоутримувача",
                "description": "Код ЄДРПОУ юридичної особи балансоутримувача полігону. Наприклад: 01411082",
                "datatype": "string",
                "required": true
            },
            {
                "name": "workingHours",
                "title": "Режим роботи полігона",
                "description": "Дні тижня позначаються комбінаціями літер (Пн, Вт, Ср, Чт, Пт, Сб, Нд), години — цифрами у 24-годинному форматі (ГГ:ХХ). Для графіка з понеділка до п’ятниці, з 9:00 до 17:00 запис в таблиці матиме вигляд — Пн-Пт 09:00-17:00. Коли потрібно позначити інтервал днів (з понеділка до п’ятниці), використовується дефіс, коли окремі дні (понеділок та п’ятниця) — кома. Наприклад: графік роботи в понеділок і п’ятницю з 09:00-17:00 матиме такий вигляд: Пн,Пт 09:00-17:00. Якщо графік змінюється протягом тижня, різні режими роботи необхідно записати через кому. Наприклад: Пн-Чт 08:00-17:20, Пт 08:00-16:00",
                "datatype": "string",
                "required": true
            },
            {
                "name": "wasteType",
                "title": "Види відходів, що приймаються на полігон",
                "description": "Вказуються типи відходів, які приймаються. Наприклад: тверді побутові відходи, будівельні відходи, харчові відходи, відходи тваринництва тощо",
                "datatype": "string",
                "required": true
            },
            {
                "name": "tariffs",
                "title": "Тарифи на надання послуг із захоронення побутових відходів",
                "description": "Вказується вартість в гривнях за захоронення одного кубічного метра відходів. Роздільник десяткових значень крапка. Наприклад: 100.0",
                "datatype": "decimal",
                "required": true
            },
            {
                "name": "currencyCode",
                "title": "Валюта",
                "description": "Літерний код валюти, в якій вказана вартість відповідно до ДСТУ ISO 4217:2010. Наприклад: UAH",
                "datatype": "string",
                "required": true
            },
            {
                "name": "protectionName",
                "title": "Найменування структури, що забезпечує охорону полігона побутових відходів",
                "description": "Повна назва юридичної особи або прізвище, ім’я та по батькові фізичної особи - підприємця (далі – ФОП), що забезпечує охорону полігона побутових відходів. Наприклад: ТОВ «Охорона»",
                "datatype": "string",
                "required": true
            },
            {
                "name": "protectionId",
                "title": "Код ЄДРПОУ структури, що забезпечує охорону полігона побутових відходів",
                "description": "Код ЄДРПОУ юридичної особи що забезпечує охорону полігона побутових відходів. Наприклад: 01411082. Дані реєстраційного номера облікової картки платника податків (далі – РНОКПП) ФОП знеособлюються",
                "datatype": "string",
                "required": true
            },
            {
                "name": "landfillArea",
                "title": "Площа полігону",
                "description": "Вказується площа полігону у квадратних метрах. В якості десяткового розділювача використовується крапка. Наприклад: 10000.00",
                "datatype": "decimal",
                "required": true
            },
            {
                "name": "usedArea",
                "title": "Використана площа полігону",
                "description": "Вказується використана площа полігону у квадратних метрах. В якості десяткового розділювача використовується крапка. Наприклад: 5000.00",
                "datatype": "decimal",
                "required": true
            },
            {
                "name": "prohibitedWaste",
                "title": "Перелік відходів заборонених для захоронення на полігоні",
                "description": "Перелік промислових відходів і речовин, заборонених для захоронення на полігоні. Вказується перелік речовин, які заборонені для захоронення на полігоні, кілька значень розділяються комою. Наприклад: радіоактивні відходи, хімічні відходи",
                "datatype": "string",
                "required": true
            },
            {
                "name": "contractsEnterprisesName",
                "title": "Назви підприємств, із якими оформлені договори на захоронення відходів",
                "description": "Перелік підприємств, з якими оформлені договори на надання послуг із захоронення побутових відходів. Якщо підприємств кілька, їхні назви вказуються через кому",
                "datatype": "string",
                "required": true
            },
            {
                "name": "contractsEnterprisesId",
                "title": "Коди ЄДРПОУ підприємств, із якими оформлені договори на захоронення відходів",
                "description": "Перелік кодів ЄДРПОУ підприємств, з якими оформлені договори на надання послуг із захоронення побутових відходів. Якщо підприємств кілька, їхні назви вказуються через кому",
                "datatype": "string",
                "required": true
            },
            {
                "name": "vehicleCapacity",
                "title": "Інформація про транспортні засоби, які перевозять відходи",
                "description": "Інформація про місткість кузовів та коефіцієнт ущільнення  транспортних засобів, в яких підприємства перевозять побутові відходи",
                "datatype": "string",
                "required": true
            },
            {
                "name": "CATUTTC",
                "title": "Код КАТОТТГ",
                "description": "Код КАТОТТГ адміністративної одиниці. Наприклад: UA32140050010021659",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressPostCode",
                "title": "Поштовий індекс",
                "description": "Поштовий індекс адреси об’єкта благоустрою. Наприклад: 01234.",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL1",
                "title": "Країна",
                "description": "Назва країни. У колонці має бути зазначено Україна",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL2",
                "title": "Регіон",
                "description": "Назва регіону, де розміщений полігон твердих побутових відходів. Наприклад: Полтавська область",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL3",
                "title": "Район",
                "description": "Назва району, де розміщений полігон твердих побутових відходів. Наприклад: Броварський район. У разі відсутності вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressAdminUnitL4",
                "title": "Територіальна громада",
                "description": "Назва територіальної громади, де розміщений полігон твердих побутових відходів. Наприклад: Згурівська. У разі відсутності вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressPostName",
                "title": "Населений пункт",
                "description": "Назва населеного пункту або назва селищної чи сільської ради, де розміщений полігон твердих побутових відходів. У колонці потрібно зазначати лише назву (без слова “місто”, “селищна рада” та їхніх скорочень “м.” та “с. р.”). Наприклад: Балта",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressThoroughfare",
                "title": "Вулиця або аналог",
                "description": "Тип та назва площі, майдану, шосе, проспекту, бульвару, алеї, провулку, узвозу тощо, де розміщений полігон твердих побутових відходів. Наприклад: вул. Харківська",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressLocatorDesignator",
                "title": "Номер будівлі",
                "description": "Номер будівлі (об’єкта), де розміщений полігон твердих побутових відходів, може включати числа та букви. Наприклад: 15-А",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressLocatorBuilding",
                "title": "Номер корпусу",
                "description": "Номер корпусу, де розміщений полігон твердих побутових відходів, зазначається числом для об’єктів, які складаються з декількох корпусів. Наприклад: 3. У разі відсутності, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressDescription",
                "title": "Опис розміщення",
                "description": "Опис вказується за потреби, щоб чіткіше визначити розміщення. Наприклад: 47 кілометр траси Київ-Обухів",
                "datatype": "string",
                "required": false
            },
            {
                "name": "lat",
                "title": "Географічна широта",
                "description": "Географічна широта місця розміщення полігону. Розділювач десяткових значень – крапка. Наприклад: 50.457718. У разі відсутності вказати: null",
                "datatype": "decimal",
                "required": true
            },
            {
                "name": "lon",
                "title": "Географічна довгота",
                "description": "Географічна довгота місця розміщення полігону. Розділювач десяткових значень — крапка. Наприклад: 30.487021. У разі відсутності вказати: null",
                "datatype": "decimal",
                "required": true
            }
        ]
    },
    "primaryKey": "uid"
}