{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": "uId",
                "title": "Ідентифікатор",
                "description": "Унікальний ідентифікатор проекту регуляторного акта. Ідентифікатором може бути рік, на який ухвалений план, і порядковий номер у переліку, що розділені знаком дефіс. Наприклад: 2019-01. Розпорядники можуть використовувати власні ідентифікатори",
                "datatype": "string",
                "required": true
            },
            {
                "name": "title",
                "title": "Назва проєкту регуляторного акта",
                "description": "Назва проєкту  регуляторного акта. Наприклад: Порядок встановлення режиму роботи закладів торгівлі, ресторанного господарства, сфери послуг та розваг",
                "datatype": "string",
                "required": true
            },
            {
                "name": "legalActTitle",
                "title": "Назва проекту нормативно-правового акта",
                "description": "Повна назва проекту нормативно-правового акта, який виноситься на розгляд регуляторного органу. Наприклад: Проект рішення Вінницької міської ради “Про встановлення режиму роботи закладів торгівлі, ресторанного господарства, сфери послуг та розваг, розташованих на території м. Вінниці”",
                "datatype": "string",
                "required": true
            },
            {
                "name": "type",
                "title": "Вид проекту",
                "description": "Вид проекту може мати одне зі значень: (а) прийняття нового регуляторного акта, (б) внесення змін до регуляторного акта, (в) скасування діючого регуляторного акта. Наприклад: внесення змін до регуляторного акта",
                "datatype": "string",
                "required": true
            },
            {
                "name": "objective",
                "title": "Ціль прийняття",
                "description": "Стислий виклад цілі або цілей прийняття регуляторного акта. Наприклад: Встановлення (за погодженням з власниками) зручного для населення режиму роботи закладів торгівлі, ресторанного господарства, сфери послуг та розваг, розташованих на території міста Вінниці. Якщо у проекті визначено декілька цілей, їх треба розділити знаком крапка з комою",
                "datatype": "string",
                "required": true
            },
            {
                "name": "isVersionOfІd",
                "title": "Ідентифікатор акта, до якого вносяться зміни",
                "description": "Якщо проект передбачає внесення змін до чинного регуляторного акта, необхідно вказати ідентифікатор регуляторного акта з набору даних “Перелік діючих регуляторних діючих актів” (колонка uid). Наприклад: 719-2014-05-29. Якщо ідентифікатор відсутній, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "isVersionOfTitle",
                "title": "Назва акта, до якого вносяться зміни",
                "description": "Якщо проект передбачає внесення змін до чинного регуляторного акта, необхідно вказати назву регуляторного акта з набору даних \"Перелік регуляторних актів\" (колонка title). Наприклад: Порядок встановлення режиму роботи закладів торгівлі, ресторанного господарства, сфери послуг та розваг",
                "datatype": "string",
                "required": false
            },
            {
                "name": "creatorName",
                "title": "Повна назва розробника",
                "description": "Повна назва органу й підрозділу відповідального за розробку проекту регуляторного акта або прізвище, ім'я, по батькові розробників. Наприклад: Департамент економіки і інвестицій Вінницької міської ради",
                "datatype": "string",
                "required": true
            },
            {
                "name": "creatorId",
                "title": "Ідентифікатор розробника",
                "description": "Номер розробника проекту регуляторного акта в Єдиному державному реєстрі юридичних осіб, фізичних осіб-підприємців та громадських формувань (ЄДРПОУ). Наприклад: 01411082. Якщо розробник немає коду ЄДРПОУ, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "creationEndDate",
                "title": "Кінець строку розробки",
                "description": "Кінцева дата строку розробки проекту регуляторного акта у форматі ISO 8601 (рррр-мм-дд). Якщо планом затверджено місяць чи квартал, то необхідно зазначити останній день цього періоду. Наприклад: 2019-06-01",
                "datatype": "date",
                "required": true
            },
            {
                "name": "url",
                "title": "Посилання в мережі Інтернет",
                "description": "Посилання на оприлюднений проект регуляторного акта в мережі Інтернет (URL). Посилання має починатися з http:// або https://. Наприклад: https://www.example.gov.ua/example/",
                "datatype": "anyURL",
                "required": true
            },
            {
                "name": "text",
                "title": "Текст ",
                "description": "Вказується назва файлу із текстовим вмістом.",
                "datatype": "string",
                "required": true
            },
            {
                "name": "bibliographicCitation",
                "title": "Посилання в друкованих виданнях",
                "description": "Посилання має включити достатню кількість подробиць для того, щоб точно визначити джерело. Рекомендовано використовувати ДСТУ 8302:2015. Наприклад: Вісник Поділля. 2014. Вип. 12/2. С. 2. Якщо посилання відсутнє, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "submissionDate",
                "title": "Дата внесення на розгляд",
                "description": "Дата внесення проекту регуляторного органу на розгляд у форматі ISO 8601 (рррр-мм-дд). Наприклад: 2018-10-05",
                "datatype": "date",
                "required": true
            },
            {
                "name": "authorityName",
                "title": "Назва регуляторного органу",
                "description": "Повна назва регуляторного органу, яким буде затверджено проект регуляторного акта. Наприклад: Виконавчий комітет Вінницької міської ради",
                "datatype": "string",
                "required": true
            },
            {
                "name": "authorityId",
                "title": "Ідентифікатор регуляторного органу",
                "description": "Номер регуляторного органу в Єдиному державному реєстрі юридичних осіб, фізичних осіб-підприємців та громадських формувань (код ЄДРПОУ). Наприклад: 01411082. Якщо регуляторний орган не має коду ЄДРПОУ, вказати: null",
                "datatype": "string",
                "required": false
            }
        ]
    },
    "primaryKey": "uid"
}