{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": "uid",
                "title": "Ідентифікатор маршруту",
                "description": "Унікальний ідентифікатор маршруту громадського транспорту. Ідентифікатором може бути номер маршруту. Наприклад: 23А",
                "datatype": "string",
                "required": true
            },
            {
                "name": "agencyId",
                "title": "Ідентифікатор перевізника",
                "description": "Ідентифікатор перевізника з таблиці agency (колонка agencyId). Наприклад: 01234567. Якщо на маршруті працює декілька перевізників, інформація для кожного з перевізників зазначається в окремому рядку. При цьому ідентифікатор маршруту та інша інформація мають дублюватися",
                "datatype": "string",
                "required": true
            },
            {
                "name": "shortName",
                "title": "Коротка назва",
                "description": "Коротка назва маршруту, що використовується для навігації пасажирів у схемах, графіках руху. Як правило, це номер маршруту. Наприклад: 23А",
                "datatype": "string",
                "required": true
            },
            {
                "name": "fullName",
                "title": "Повна назва",
                "description": "Повна назва маршруту або назва, що використовується в документах. Наприклад: Автобусний маршрут №23А вул. Марії Приймаченко — Металургійний комбінат",
                "datatype": "string",
                "required": true
            },
            {
                "name": "description",
                "title": "Опис маршруту",
                "description": "Опис маршруту містить кількісну та якісну інформацію про маршрут. Наприклад: Автобус розпочинає рух із мікрорайону Заріччя, рухається центром міста (вул. Сергія Параджанова) та прибуває до залізничного вокзалу. Тривалість маршруту 35 хв. Частота відправлення автобусів 5-25 хв",
                "datatype": "string",
                "required": false
            },
            {
                "name": "type",
                "title": "Тип транспорту",
                "description": "Тип транспортних засобів, що використовуються на маршруті, позначається кодом (лише цифра): 0 — трамвай, легка залізниця; 1 — метро; 2 — залізниця; 3 — автобус, тролейбус; 7 — фунікулер. Наприклад: 3",
                "datatype": "integer",
                "required": true
            },
            {
                "name": "homepage",
                "title": "Посилання",
                "description": "Посилання на сторінку в мережі Інтернет, що містить інформацію про маршрут. Посилання має починатися з http:// або https://. Наприклад: https://www.example.com.ua/r23",
                "datatype": "anyURL",
                "required": false
            },
            {
                "name": "colour",
                "title": "Колір маршруту",
                "description": "Колір, яким позначається лінія маршруту на схемах. Він може бути позначеним словом у чоловічому роді або кодом. Наприклад: червоний. Якщо розпорядник має навички роботи з кодами кольорів HTML, бажано вказати код. Наприклад: FF0000. Якщо колір відсутній, зазначається білий колір або FFFFFF",
                "datatype": "string",
                "required": false
            },
            {
                "name": "textColour",
                "title": "Колір тексту",
                "description": "Колір, яким позначається текст про маршрут на схемах. Він може бути позначеним словом у чоловічому роді або кодом. Наприклад: чорний. Якщо розпорядник має навички роботи з кодами кольорів HTML, бажано вказати код. Наприклад: 000000. Якщо колір відсутній, зазначається білий колір або FFFFFF",
                "datatype": "string",
                "required": false
            },
            {
                "name": "sortOrder",
                "title": "Порядковий номер",
                "description": "Довільний порядковий номер використовується для того, щоб розташувати маршрути в зручному порядку для користувачів таблиці. Наприклад: 002",
                "datatype": "string",
                "required": false
            }
        ]
    },
    "primaryKey": "uid"
}