{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": "routeuid",
                "title": "Ідентифікатор маршруту",
                "description": "Унікальний ідентифікатор маршруту з таблиці routes набору даних “Перелік перевізників, що надають транспортні послуги з перевезення пасажирів міським електричним та автомобільним транспортом, у тому числі маршрути перевезень” (колонка uid). Наприклад: 12А",
                "datatype": "string",
                "required": true
            },
            {
                "name": "serviceUid",
                "title": "Тижневий графік роботи",
                "description": "Ідентифікатор тижневого графіка роботи, маршруту з таблиці calendar (колонка serviceId). Він показує, в які дні тижня відбуваються рейси. Наприклад: пн-вт-ср-чт-пт",
                "datatype": "string",
                "required": true
            },
            {
                "name": "uid",
                "title": "Ідентифікатор рейсу",
                "description": "Унікальний ідентифікатор рейсу. Це може бути порядковий номер рейсу протягом доби. Наприклад, перший рейс позначається: 01, другий 02, третій – 03 і так далі",
                "datatype": "string",
                "required": true
            },
            {
                "name": "eadsign",
                "title": "Кінцева зупинка",
                "description": "Якщо різні рейси на маршруті мають різні кінцеві зупинки, необхідно вказати кінцеву зупинку даного рейсу. В іншому випадку вказати кінцеву зупинку для всього маршруту. Наприклад: Індустріальний мікрорайон",
                "datatype": "string",
                "required": false
            },
            {
                "name": "directionId",
                "title": "Напрямок руху",
                "description": "Для позначення рейсів у напрямку маршруту використовується 0, у зворотному напрямку – 1. Наприклад: 0",
                "datatype": "integer",
                "required": false
            },
            {
                "name": "blockId",
                "title": "Блок рейсів",
                "description": "Якщо один транспортний засіб виконує два і більше послідовних рейси за певним тижневим графіком, їх можна об’єднати у блоки. Кожен блок позначається довільним ідентифікатором. Наприклад: АВ1234ЕІ-01",
                "datatype": "string",
                "required": false
            },
            {
                "name": "shapeuid",
                "title": "Лінія маршруту",
                "description": "Якщо розпорядник використовує повну версію GTFS, необхідно зазначити ідентифікатор лінії маршруту з таблиці shapes - атрибут uid. В іншому випадку лишити колонку вільною",
                "datatype": "string",
                "required": false
            }
        ]
    },
    "primaryKey": "routeuid"
}