{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": "uid",
                "title": "Унікальний ідентифікатор, визначений аудитором для набору даних ",
                "description": "Вказується довільний унікальний ідентифікатор",
                "datatype": "string",
                "required": true
            },
            {
                "name": "title ",
                "title": "Назва набору даних",
                "description": "Вказується назва набору інформації. Наприклад: Архів звернень громадян за 2016 – 2021 роки",
                "datatype": "string",
                "required": true
            },
            {
                "name": "type",
                "title": "Тип даних: База даних, реєстр документів, файл тощо",
                "description": "Необхідно вказати тип даних, які описуються: база даних, спеціалізоване програмне забезпечення, набір (архів, підбірка) файлів або документів, тощо. Вказується також формат документу: паперовий або електронний.\nДля підбірки документів, які містять неструктуровану інформацію – текст, вказується реєстр.\nНаприклад: система ведення документообігу «Діловод»",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dataUser",
                "title": "Назва структурного підрозділу, який заповнює інформацію",
                "description": "Вказується назва структурного підрозділу, що працює з даними. Наприклад: Відділ документообігу та звернень громадян",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dataCreator",
                "title": "Назва структурного підрозділу, який створює набір даних",
                "description": "Вказується назва структурного підрозділу, який створює дані. Наприклад: Відділ документообігу та звернень громадян",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dataTransfer",
                "title": "Орган (структурний підрозділ), якому передається інформація",
                "description": "Вказується назва структурного підрозділу, якому надається інформація із набору даних. У випадку, якщо така передача відбувається. \nНаприклад: Відділ зв’язків із громадськістю.\nЯкщо інформація не передається, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "dataUserName",
                "title": "ПІБ уповноваженої особи, яка працює із набором даних",
                "description": "Вказується ПІБ (прізвище, ім’я та по батькові) посадової особи (працівника), яка працює із набором даних. Наприклад: Петренко Валентина Петрівна",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dataUserTelephone",
                "title": "Контактний номер телефону особи, яка працює з даними",
                "description": "Номер телефону має починатися з +380, включати код населеного пункту або оператора та телефонний номер (12 цифр, без пробілів та знаків пунктуації, зокрема дужок). Наприклад: +380123456789. У електронних таблицях допускається написання коду країни 380 або використання комбінації ‘+ (апостроф та плюс). У випадку кількох номерів телефону розділити значення комою",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dataUserEmail",
                "title": "Контактна адреса електронної пошти особи, яка працює з даними",
                "description": "Адреса електронної пошти. Наприклад, contact@example.gov.ua. У випадку кількох адрес розділити значення комами",
                "datatype": "string",
                "required": true
            },
            {
                "name": "description",
                "title": "Опис інформації, яка міститься в файлі або базі даних",
                "description": "Надається загальний опис інформації. Наприклад:\nАрхів звернень громадян за 2016 - 2020 роки, який зберігається в програмному забезпеченні для ведення документообігу «Діловод» в Макарівській селищній раді",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dateCreated",
                "title": "Дата, коли дані були зібрані чи створені",
                "description": "Для набору даних, який постійно оновлюється, дата створення такого набору. Дата вказується у форматі ISO 8601 (рррр-мм-дд). Наприклад: 2016-01-01",
                "datatype": "date",
                "required": true
            },
            {
                "name": "recordsNumber",
                "title": "Кількість записів у файлі або базі даних",
                "description": "Вказується загальне число документів, або записів у базі даних чи реєстрі.\nНаприклад: 150689",
                "datatype": "integer",
                "required": true
            },
            {
                "name": "purpose",
                "title": "Підстава (нормативний документ) для створення цієї інформації",
                "description": "Нормативний документ, який є підставою для збору створення інформації. Кілька значень розділяються комою. Наприклад: Закон України «Про доступ до публічної інформації», постанова  Кабінету Міністрів України від 17 січня 2018 року № 55 «Деякі питання документування управлінської діяльності»",
                "datatype": "string",
                "required": true
            },
            {
                "name": "source ",
                "title": "Джерело інформації в цьому наборі даних (у разі наявності)",
                "description": "Вказується джерело отримання даних: звернення громадян, дані містобудівного кадастру тощо. \nНаприклад: листи та звернення громадян, запити на інформацію, які надійшли поштою та засобами електронного зв’язку",
                "datatype": "string",
                "required": true
            },
            {
                "name": "updatingFrequency",
                "title": "Частота оновлення набору даних",
                "description": "Вказується частота оновлення інформації, наприклад: «Щоденно», «Раз на тиждень», «Раз на місяць».\nНаприклад: Щоденно",
                "datatype": "string",
                "required": true
            },
            {
                "name": "usageFrequency",
                "title": "Частота використання інформації",
                "description": "Вказується частота використання інформації, наприклад: «Щоденно», «Раз на тиждень», «Раз на місяць».\nНаприклад: Щоденно",
                "datatype": "string",
                "required": false
            },
            {
                "name": "publicInterest",
                "title": "Статистика запитуваності інформації, яка міститься в наборі даних, громадськістю",
                "description": "Вказується оціночна частота запитів громадськості щодо отримання даних, які містяться в наборі: раз на рік, кілька разів на рік, тощо.\nНаприклад: раз на рік",
                "datatype": "string",
                "required": true
            },
            {
                "name": "govermentInterest",
                "title": "Статистика запитуваності інформації, яка міститься в наборі даних, іншими державними органами та органами місцевого самоврядування",
                "description": "Вказується оціночна частота запитів інших державних органів, органів місцевого самоврядування щодо отримання даних, які містяться в наборі. Наприклад: раз на місяць",
                "datatype": "string",
                "required": true
            },
            {
                "name": "relation",
                "title": "Опис зв’язків з іншими наборами даних, базами даних",
                "description": "Вказується, чи цей набір інформації інтегрований із іншими наборами інформації, архівами, базами даних тощо. \nЯкщо так, то вказати із якими.\nНаприклад: ні",
                "datatype": "string",
                "required": false
            },
            {
                "name": "format ",
                "title": "Формат інформації (на цей момент)",
                "description": "Вказується формат, в якому зберігаються дані, або формат, в якому вони можуть вивантажуватись із бази даних або програмного забезпечення. Наприклад: CSV",
                "datatype": "string",
                "required": true
            },
            {
                "name": "structure",
                "title": "Перелік полів, які містяться в файлі або базі даних",
                "description": "Для файлів (таблиць), реєстрів, ієрархічних даних вказується перелік полів.\nДля реляційної бази даних, яка є частиною одного програмного комплексу, вказується назва таблиці та перелік полів, які в ній містяться. Назви вказуються через кому. Наприклад: ПІБ заявника, тема заяви, дата заяви",
                "datatype": "string",
                "required": true
            },
            {
                "name": "restrictedFields",
                "title": "Перелік полів, які не можуть бути оприлюднені через те, що містять інформацію з обмеженим доступом",
                "description": "Для файлів (таблиць), реєстрів, ієрархічних даних вказується перелік полів.\nДля реляційної бази даних, яка є частиною одного програмного комплексу, вказується назва таблиці та перелік полів, які в ній містяться. Назви вказуються через кому. \nНаприклад: ПІБ заявника",
                "datatype": "string",
                "required": true
            },
            {
                "name": "documentation ",
                "title": "Документація, яка є для цього набору даних або програмного забезпечення",
                "description": "Вказати наявність та опис документації, яка наявна для набору даних або програмного забезпечення. Якщо документація оприлюднена в мережі інтернет, додатково вказати посилання на документацію.\nНаприклад: інструкція користувача",
                "datatype": "string",
                "required": true
            },
            {
                "name": "developerName",
                "title": "Назва розробника програмного забезпечення",
                "description": "Вказується назва розробника програмного забезпечення. Наприклад: ТОВ «Діловод солюшенс»",
                "datatype": "string",
                "required": true
            },
            {
                "name": "developerId",
                "title": "Ідентифікатор розробника програмного забезпечення",
                "description": "Вказується код ЄДРПОУ розробника програмного забезпечення. Або інший індентифікатор відповідно до міжнародного законодавства у випадку, якщо розробник - нерезидент",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dictionary",
                "title": "Довідники, які доступні для набору даних",
                "description": "Вказується, чи створені для набору даних довідники (словники), стандарти, які містять перелік та опис значень атрибутів набору даних",
                "datatype": "string",
                "required": true
            },
            {
                "name": "size",
                "title": "Розмір набору даних (Мб, Гб)",
                "description": "Вказується розмір набору даних, що зберігається в цифровому вигляді. Наприклад: 3 гб",
                "datatype": "string",
                "required": true
            },
            {
                "name": "resource",
                "title": "Інформація про те, чи створено на основі набору даних аналітичні ресурси, інструменти тощо ",
                "description": "Вказується відома інформація про те, чи створено на основі даних будь, які аналітичні інструменти, рішення, додатки тощо. Якщо так то вказується їхня URL-адреса",
                "datatype": "anyURL",
                "required": false
            },
            {
                "name": "url",
                "title": "Якщо набір оприлюднено, то надати посилання",
                "description": "Якщо дані із набору або бази даних оприлюднені або регулярно оприлюднюються, надати посилання",
                "datatype": "anyURL",
                "required": false
            }
        ]
    },
    "primaryKey": "uid"
}