{
    "context": {
        "@context": "http://www.w3.org/ns/csvw",
        "@language": "uk"
    },
    "tableSchema": {
        "columns": [
            {
                "name": " buildingId",
                "title": "Ідентифікатор",
                "description": "Ідентифікатором об’єкта може може бути код ЄДРПОУ балансоутримувача та інвентарний номер об’єкта, що розділені знаком дефіс «-». Наприклад: 01234567-10000234. Розпорядники можуть використовувати власні ідентифікатори",
                "datatype": "string",
                "required": true
            },
            {
                "name": "isPartOf",
                "title": "Назва майнового комплексу",
                "description": "Назва майнового комплексу, частиною якого є об’єкт. Наприклад: Комплекс авторемонтних майстерень КП «Полтаваелектротранс». Якщо об’єкт не є частиною майнового комплексу, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": " buildingTitle",
                "title": "Назва",
                "description": "Назва об’єкта. Наприклад: Навчальний корпус",
                "datatype": "string",
                "required": true
            },
            {
                "name": "description",
                "title": "Опис",
                "description": "Опис об’єкта комунальної власності в довільній формі. Наприклад: гараж розрахований на 5 вантажних транспортних засобів. Кожне місце обладнане оглядовою ямою. Матеріал стін — цегла. Рік побудови — 1965. Висота в'їзних воріт — 5,3 м., висота стелі — 6,5 м.. Останній поточний ремонт проведено у 2005 році. Якщо опис відсутній, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "ownercustodianName",
                "title": "Назва власника",
                "description": "Найменування (організаційно-правова форма та назва) юридичної особи, яка є власником об’єкта. Наприклад: Олександрійська міська рада",
                "datatype": "string",
                "required": true
            },
            {
                "name": "ownercustodianId",
                "title": "Ідентифікатор власника",
                "description": "Код ЄДРПОУ юридичної особи, яка є власником об’єкта. Наприклад: 01411082",
                "datatype": "string",
                "required": true
            },
            {
                "name": "balanceHolderName",
                "title": "Назва балансоутримувача",
                "description": "Найменування (організаційно-правова форма та назва) юридичної особи, яка є балансоутримувачем об'єкта. Наприклад: Міська лікарня № 4 Житомирської міської ради. Якщо балансоутримувач відсутній, зазначити: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "balanceHolderId",
                "title": "Ідентифікатор балансоутримувача",
                "description": "Код ЄДРПОУ юридичної особи, яка є балансоутримувачем об’єкта. Наприклад: 01411082. Якщо балансоутримувач відсутній, зазначається: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "userName",
                "title": "Назва користувача",
                "description": "Найменування (організаційно-правова форма та назва) юридичної особи або прізвище, ім’я та по батькові фізичної особи-підприємця, яка є користувачем об'єкта комунальної власності. Наприклад: Приватне підприємство «Аптека № 3». Якщо користувач збігається з балансоутримувачем, вказати дані останнього",
                "datatype": "string",
                "required": false
            },
            {
                "name": "userId",
                "title": "Ідентифікатор користувача",
                "description": "Код ЄДРПОУ юридичної особи, яка є користувачем об’єкта. Наприклад: 01411082. Якщо користувач збігається з балансоутримувачем, вказати дані останнього",
                "datatype": "string",
                "required": false
            },
            {
                "name": "dk018classId",
                "title": "Код класу ДК 018-2000",
                "description": "Код класу, який відповідає об’єкту комунальної власності, в Державному класифікаторі будівель та споруд ДК 018-2000. Наприклад: 1242.1",
                "datatype": "string",
                "required": true
            },
            {
                "name": "dk018classDescription",
                "title": "Назва класу ДК 018-2000",
                "description": "Назва класу, який відповідає об’єкту комунальної власності, в Державному класифікаторі будівель та споруд ДК 018-2000. Наприклад: Будівлі шкіл та інших середніх навчальних закладів",
                "datatype": "string",
                "required": true
            },
            {
                "name": "unitName",
                "title": "Назва одиниці виміру",
                "description": "Одиницею виміру може бути метр квадратний (кв. м.) або, якщо площа невідома, штука (шт.). Наприклад: шт.",
                "datatype": "string",
                "required": true
            },
            {
                "name": " buildingArea",
                "title": "Площа або кількість штук",
                "description": "Площа об’єкта комунальної власності у квадратних метрах або кількість штук (якщо площа невідома). Потрібно зазначити лише число без одиниць виміру (кв. м., шт.). Наприклад: 11450.60. Десяткові значення відділяються крапкою або комою. Потрібно дотримуватися одного розділювача для всієї таблиці",
                "datatype": "decimal",
                "required": true
            },
            {
                "name": "CATUTTC",
                "title": "Код КАТОТТГ",
                "description": "Код КАТОТТГ адміністративної одиниці. Наприклад: UA32140050010021659",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressPostCode",
                "title": "Поштовий індекс",
                "description": "Поштовий індекс адреси розташування об’єкта. Наприклад: 01234",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL1",
                "title": "Країна",
                "description": "Назва держави. У колонці має бути зазначено: Україна",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL2",
                "title": "Регіон",
                "description": "Назва регіону місця розташування об’єкта. Наприклад: Полтавська область",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressAdminUnitL3",
                "title": "Район",
                "description": "Назва району. Наприклад: Броварський район. У разі відсутності вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressAdminUnitL4",
                "title": "Територіальна громада",
                "description": "Назва територіальної громади. Наприклад: Згурівська. У разі відсутності вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressPostName",
                "title": "Населений пункт",
                "description": "Назва населеного пункту або назва селищної чи сільської ради. У колонці потрібно зазначати лише назву (без слова «місто», «селищна рада» та їх скорочень «м.» та «с. р.»). Наприклад: Балта",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressThoroughfare",
                "title": "Вулиця або аналог",
                "description": "Тип та назва площі, майдану, шосе, проспекту, бульвару, алеї, провулку, узвозу тощо. Наприклад: вул. Харківська",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressLocatorDesignator",
                "title": "Номер об’єкта",
                "description": "Номер об’єкта (будівлі) може включати числа та букви. Наприклад: 15-А",
                "datatype": "string",
                "required": true
            },
            {
                "name": "addressLocatorBuilding",
                "title": "Номер корпусу",
                "description": "Номер корпусу зазначається числом для об’єктів, які складаються з декількох корпусів. Наприклад: 3. У разі відсутності вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "addressLocatorName",
                "title": "Назва будівлі або її частини",
                "description": "Назва або опис, що дозволяє чіткіше визначити розміщення. Зокрема, назва житлового комплексу, школи, лікарні, офісного або торгового центру; частина будівлі, наприклад, крило; приміщення в будівлі, наприклад, квартира, кабінет, офіс, зала; інший варіант написання номера адреси; довільний текстовий опис, що дозволяє визначити розміщення; інший ідентифікатор. Якщо назва будівлі або її частини відсутня, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "registrationStatus",
                "title": "Статус реєстрації",
                "description": "Статус реєстрації речових прав на нерухоме майно може мати одне з чотирьох значень: Невідомо, У процесі реєстрації, Зареєстровано, Не зареєстровано. Наприклад: У процесі реєстрації",
                "datatype": "string",
                "required": true
            },
            {
                "name": "registrationId",
                "title": "Реєстраційний номер",
                "description": "Реєстраційний номер майна у Державному реєстрі речових прав на нерухоме майно. Наприклад: 321456987654. Якщо номер відсутній, вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "registrationDate",
                "title": "Дата реєстрації",
                "description": "Дата державної реєстрації або дата прийняття рішення про державну реєстрацію речових прав на нерухоме майно у форматі ISO 8601 (рррр-мм-дд). Наприклад: 2014-05-30. Якщо номер відсутній, вказати: null",
                "datatype": "date",
                "required": false
            },
            {
                "name": "constructionReadiness",
                "title": "Рівень будівельної готовності",
                "description": "Рівень будівельної готовності для об’єктів будівництва в цілих відсотках від 0 до 100 (без знаку %). Наприклад: 60. Якщо рівень будівельної готовності невідомий, вказати «Невідомо». У випадку об'єктів, що вже введені в експлуатацію, вказати: null",
                "datatype": "integer",
                "required": false
            },
            {
                "name": "condition",
                "title": "Стан будівель та споруд",
                "description": "Стан будівель та споруд, які введені в експлуатацію. Може мати одне зі значень: Не потребує ремонту, Потребує поточного ремонту, Потребує капітального ремонту, Невідомо. Наприклад: Потребує поточного ремонту. У випадку об’єктів будівництва вказати: null",
                "datatype": "string",
                "required": false
            },
            {
                "name": "utilitiesAvailable",
                "title": "Наявність комунальних комунікацій",
                "description": "Підключення/підведення комунальних комунікацій до об'єктів. Необхідно вказати перелік, що може містити одне або декілька значень, що розділені комою «,»: постачання електроенергії, постачання природного газу, централізоване водопостачання, централізоване водовідведення, теплопостачання, постачання гарячої води. Наприклад: постачання електроенергії, централізоване водопостачання. Якщо інформація невідома, зазначити: Невідомо. Якщо комунікації відсутні, зазначити: null",
                "datatype": "string",
                "required": false
            }
        ]
    },
    "primaryKey": "buildingId"
}